greetings = [
  # Варианты приветствий
  "В кои-то веки",
  "Вот так встреча",
  "Всегда рады Вам",
  "Глубокое почтение",
  "Горячий привет",
  "Горячо приветствую",
  "Доброго здоровья",
  "Добро пожаловать",
  "Душою рад Вас видеть",
  "Желаю здравствовать",
  "Здравия желаю",
  "Здравствуйте",
  "Какая встреча",
  "Какие гости",
  "Моё почтение",
  "Нижайшее почтение",
  "Позвольте Вас приветствовать",
  "Привет",
  "Рад Вам",
  "Разрешите Вас приветствовать",
  "С возвращением",
  "С выздоровлением",
  "Сердечно приветствую Вас",
  "Сердечно рад Вам",
  "Сердечный поклон Вам",
  "Сердечный привет Вам",
  "Сколько лет, сколько зим",
  "Тысячу лет Вас не видел"
]

answers = [
  # Положительные
  "Бесспорно",
  "Предрешено",
  "Никаких сомнений",
  "Определённо да",
  "Можешь быть уверен в этом",
  # Нерешительно положительные
  "Мне кажется — «да»",
  "Вероятнее всего",
  "Хорошие перспективы",
  "Знаки говорят — «да»",
  "Да",
  # Нейтральные
  "Пока не ясно, попробуй снова",
  "Спроси позже",
  "Лучше не рассказывать",
  "Сейчас нельзя предсказать",
  "Сконцентрируйся и спроси опять",
  # Отрицательные
  "Даже не думай",
  "Мой ответ — «нет»",
  "По моим данным — «нет»",
  "Перспективы не очень хорошие",
  "Весьма сомнительно"
]

puts greetings.sample
sleep rand(1..3)
puts
puts answers.sample
